In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt          
%matplotlib inline

In [2]:
blackfriday_train=pd.read_csv("D:/analytics/Hackathon/AV_BlackFriday/train.csv")  # https://www.kaggle.com/c/house-prices-advanced-regression-techniques-kaggle problem

In [3]:
blackfriday_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
(blackfriday_train.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Product_Category_3            383247
Product_Category_2            173638
Purchase                           0
Product_Category_1                 0
Marital_Status                     0
Stay_In_Current_City_Years         0
City_Category                      0
Occupation                         0
Age                                0
Gender                             0
Product_ID                         0
User_ID                            0
dtype: int64

In [5]:
blackfriday_trainnum=blackfriday_train.select_dtypes(include=[np.number]) # strategy 1 split the data frame into numeric and character data frame and values
blackfriday_traincat=blackfriday_train.select_dtypes(include=[object])

In [6]:
blackfriday_trainnum.shape  # numeric variable colulmns

(550068, 7)

In [7]:
blackfriday_traincat.shape  # categorical variable columns

(550068, 5)

In [8]:
blackfriday_trainnum.head() #"MSSubClass","OverallQual","OverallCond","YearBuilt","YearRemodAdd","GarageYrBlt","MoSold","YrSold" these data values are not numeric hence deleting

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,10,0,3,NaN,NaN,8370
1,1000001,10,0,1,6.0,14.0,15200
2,1000001,10,0,12,NaN,NaN,1422
3,1000001,10,0,12,14.0,NaN,1057
4,1000002,16,0,8,NaN,NaN,7969

In [9]:
blackfriday_traincat.head()

  Product_ID Gender   Age City_Category Stay_In_Current_City_Years
0  P00069042      F  0-17             A                          2
1  P00248942      F  0-17             A                          2
2  P00087842      F  0-17             A                          2
3  P00085442      F  0-17             A                          2
4  P00285442      M   55+             C                         4+

In [10]:
blackfridayvalues=blackfriday_trainnum[["User_ID"]]

In [11]:
blackfridayvalues.head()

   User_ID
0  1000001
1  1000001
2  1000001
3  1000001
4  1000002

In [12]:
blackfriday_trainnum=blackfriday_trainnum.drop(["User_ID"],axis=1)

In [13]:
blackfriday_trainnum.head()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,10,0,3,NaN,NaN,8370
1,10,0,1,6.0,14.0,15200
2,10,0,12,NaN,NaN,1422
3,10,0,12,14.0,NaN,1057
4,16,0,8,NaN,NaN,7969

In [14]:
blackfriday_trainnum1=blackfriday_trainnum.apply(lambda  blackfriday_trainnum:  blackfriday_trainnum.fillna( blackfriday_trainnum.mean()),axis=0)

In [15]:
blackfriday_trainnum1.head()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,10,0,3,9.842329,12.668243,8370
1,10,0,1,6.000000,14.000000,15200
2,10,0,12,9.842329,12.668243,1422
3,10,0,12,14.000000,12.668243,1057
4,16,0,8,9.842329,12.668243,7969

In [16]:
(blackfriday_trainnum1.isnull().sum()).sort_values(ascending=False)

Purchase              0
Product_Category_3    0
Product_Category_2    0
Product_Category_1    0
Marital_Status        0
Occupation            0
dtype: int64

In [17]:
blackfriday_trainnum1.head()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,10,0,3,9.842329,12.668243,8370
1,10,0,1,6.000000,14.000000,15200
2,10,0,12,9.842329,12.668243,1422
3,10,0,12,14.000000,12.668243,1057
4,16,0,8,9.842329,12.668243,7969

In [18]:
from sklearn.preprocessing import LabelEncoder

In [19]:
le=LabelEncoder()

In [20]:
blackfriday_traincat.head()

  Product_ID Gender   Age City_Category Stay_In_Current_City_Years
0  P00069042      F  0-17             A                          2
1  P00248942      F  0-17             A                          2
2  P00087842      F  0-17             A                          2
3  P00085442      F  0-17             A                          2
4  P00285442      M   55+             C                         4+

In [21]:
blackfridayvalues1=blackfriday_traincat[["Product_ID"]]

In [22]:
blackfridayvalues1.head()

  Product_ID
0  P00069042
1  P00248942
2  P00087842
3  P00085442
4  P00285442

In [23]:
blackfriday_traincat=blackfriday_traincat.drop(["Product_ID"],axis=1)

In [24]:
blackfriday_traincat.head()

  Gender   Age City_Category Stay_In_Current_City_Years
0      F  0-17             A                          2
1      F  0-17             A                          2
2      F  0-17             A                          2
3      F  0-17             A                          2
4      M   55+             C                         4+

In [25]:
blackfriday_traincat1=blackfriday_traincat.apply(le.fit_transform)

In [26]:
blackfriday_traincat1.head()

   Gender  Age  City_Category  Stay_In_Current_City_Years
0       0    0              0                           2
1       0    0              0                           2
2       0    0              0                           2
3       0    0              0                           2
4       1    6              2                           4

In [27]:
blackfridaydf=pd.concat([blackfridayvalues,blackfridayvalues1,blackfriday_trainnum1,blackfriday_traincat1],axis=1)

In [28]:
blackfridaydf.head()

,User_ID,Product_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender,Age,City_Category,Stay_In_Current_City_Years
0,1000001,P00069042,10,0,3,9.842329,12.668243,8370,0,0,0,2
1,1000001,P00248942,10,0,1,6.000000,14.000000,15200,0,0,0,2
2,1000001,P00087842,10,0,12,9.842329,12.668243,1422,0,0,0,2
3,1000001,P00085442,10,0,12,14.000000,12.668243,1057,0,0,0,2
4,1000002,P00285442,16,0,8,9.842329,12.668243,7969,1,6,2,4

In [29]:
blackfridaydf1=blackfridaydf.take(np.random.permutation(len(blackfridaydf))[:1000])

In [30]:
blackfridaydf1.head()

,User_ID,Product_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender,Age,City_Category,Stay_In_Current_City_Years
95742,1002833,P00249742,15,0,1,15.000000,18.000000,4517,1,2,2,2
509028,1000412,P00315442,15,1,1,9.842329,12.668243,19360,1,3,0,1
408986,1002972,P00017242,4,1,11,9.842329,12.668243,5987,1,2,0,3
284357,1001776,P00329542,0,1,1,15.000000,16.000000,11583,1,2,1,4
413924,1003705,P00176642,7,1,6,8.000000,12.668243,19950,1,4,1,1

In [31]:
y=blackfridaydf1.Purchase
X=blackfridaydf1.drop(["User_ID","Product_ID","Purchase"],axis=1)

In [32]:
X.head()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Gender,Age,City_Category,Stay_In_Current_City_Years
95742,15,0,1,15.000000,18.000000,1,2,2,2
509028,15,1,1,9.842329,12.668243,1,3,0,1
408986,4,1,11,9.842329,12.668243,1,2,0,3
284357,0,1,1,15.000000,16.000000,1,2,1,4
413924,7,1,6,8.000000,12.668243,1,4,1,1

In [33]:
from sklearn.tree import DecisionTreeRegressor   #Decision tree

In [34]:
DecTree=DecisionTreeRegressor()

In [35]:
DecTree.fit(X,y)

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
           max_leaf_nodes=None, min_impurity_decrease=0.0,
           min_impurity_split=None, min_samples_leaf=1,
           min_samples_split=2, min_weight_fraction_leaf=0.0,
           presort=False, random_state=None, splitter='best')

In [36]:
DecTree.score(X,y)

0.99504237107418714

In [37]:
DecTreepredict=DecTree.predict(X)

In [38]:
DecTreeresidual=y-DecTreepredict

In [39]:
np.sqrt(np.mean((DecTreeresidual)**2))

360.84439259418548

In [40]:
from sklearn.linear_model import LinearRegression   # training data

In [41]:
LinReg=LinearRegression()

In [44]:
LinReg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [45]:
LinReg.score(X,y)

0.13241928594348884

In [115]:
from sklearn.cross_validation import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn import metrics                             ## https://towardsdatascience.com/building-a-logistic-regression-in-python-step-by-step-becd4d56c9c8 ##
from sklearn.metrics import classification_report

## Logistic regression, train test, cross validation ##

C:\Anaconda3\lib\site-packages\sklearn\cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [116]:
logreg = LogisticRegression()
        ## Logistic regression ##

In [ ]:
logreg.fit(X, y)

In [ ]:
logreg.score(X,y)

In [20]:
from sklearn.ensemble import RandomForestRegressor   #Random Forest

In [21]:
Randfor=RandomForestRegressor(n_estimators=800)

In [22]:
Randfor.fit(X,np.log(y))

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=800, n_jobs=1,
           oob_score=False, random_state=None, verbose=0, warm_start=False)

In [23]:
Randfor.score(X,np.log(y))

0.82546961922163842

In [24]:
Randforpredict=Randfor.predict(X)

In [24]:
from sklearn.cross_validation import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn import metrics                             ## https://towardsdatascience.com/building-a-logistic-regression-in-python-step-by-step-becd4d56c9c8 ##
from sklearn.metrics import classification_report

## Logistic regression, train test, cross validation ##

C:\Users\Phani deep\Anaconda3\lib\site-packages\sklearn\cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [ ]:
logreg = LogisticRegression()
logreg.fit(X, y)         ## Logistic regression ##

In [ ]:
logreg.score(X,y)

In [ ]:
y_pred_train = logreg.predict(X)

In [25]:
blackfriday_test=pd.read_csv("D:/analytics/Hackathon/AV_BlackFriday/test.csv")  # https://www.kaggle.com/c/house-prices-advanced-regression-techniques-kaggle problem

In [26]:
blackfriday_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [27]:
(blackfriday_test.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Product_Category_3            162562
Product_Category_2             72344
Product_Category_1                 0
Marital_Status                     0
Stay_In_Current_City_Years         0
City_Category                      0
Occupation                         0
Age                                0
Gender                             0
Product_ID                         0
User_ID                            0
dtype: int64

In [28]:
blackfriday_testnum=blackfriday_test.select_dtypes(include=[np.number]) # strategy 1 split the data frame into numeric and character data frame and values
blackfriday_testcat=blackfriday_test.select_dtypes(include=[object])

In [29]:
blackfriday_testnum.shape  # numeric variable colulmns

(233599, 6)

In [30]:
blackfriday_testcat.shape  # numeric variable colulmns

(233599, 5)

In [31]:
blackfriday_testnum1=blackfriday_testnum.apply(lambda  blackfriday_testnum:  blackfriday_testnum.fillna( blackfriday_testnum.median()),axis=0)

In [32]:
blackfriday_testnum1.head()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,7,1,1,11.0,14.0
1,1000009,17,0,3,5.0,14.0
2,1000010,1,1,5,14.0,14.0
3,1000010,1,1,4,9.0,14.0
4,1000011,1,0,4,5.0,12.0

In [33]:
blackfriday_testcat.head()

  Product_ID Gender    Age City_Category Stay_In_Current_City_Years
0  P00128942      M  46-50             B                          2
1  P00113442      M  26-35             C                          0
2  P00288442      F  36-45             B                         4+
3  P00145342      F  36-45             B                         4+
4  P00053842      F  26-35             C                          1

In [34]:
(blackfriday_testnum1.isnull().sum()).sort_values(ascending=False)

Product_Category_3    0
Product_Category_2    0
Product_Category_1    0
Marital_Status        0
Occupation            0
User_ID               0
dtype: int64

In [35]:
blackfriday_testnum1.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
User_ID,233599.0,1.003029e+06,1726.504968,1000001.0,1001527.0,1003070.0,1004477.0,1006040.0
Occupation,233599.0,8.085407e+00,6.521146,0.0,2.0,7.0,14.0,20.0
Marital_Status,233599.0,4.100702e-01,0.491847,0.0,0.0,0.0,1.0,1.0
Product_Category_1,233599.0,5.276542e+00,3.736380,1.0,1.0,5.0,8.0,18.0
Product_Category_2,233599.0,9.586475e+00,4.251302,2.0,8.0,9.0,14.0,18.0
Product_Category_3,233599.0,1.359538e+01,2.356138,3.0,14.0,14.0,14.0,18.0

In [36]:
from sklearn.preprocessing import LabelEncoder

In [37]:
le=LabelEncoder()

In [38]:
blackfriday_testcat1=blackfriday_testcat.apply(le.fit_transform)

In [39]:
blackfridaydf1=pd.concat([blackfriday_testnum1,blackfriday_testcat1],axis=1)

In [40]:
blackfridaydf1.head().transpose()

,0,1,2,3,4
User_ID,1000004.0,1000009.0,1000010.0,1000010.0,1000011.0
Occupation,7.0,17.0,1.0,1.0,1.0
Marital_Status,1.0,0.0,1.0,1.0,0.0
Product_Category_1,1.0,3.0,5.0,4.0,4.0
Product_Category_2,11.0,5.0,14.0,9.0,5.0
Product_Category_3,14.0,14.0,14.0,14.0,12.0
Product_ID,1144.0,994.0,2672.0,1299.0,519.0
Gender,1.0,1.0,0.0,0.0,0.0
Age,4.0,2.0,3.0,3.0,2.0
City_Category,1.0,2.0,1.0,1.0,2.0
Stay_In_Current_City_Years,2.0,0.0,4.0,4.0,1.0

In [41]:
X=blackfridaydf1.drop(["User_ID","Product_ID"],axis=1)

In [47]:
DecTreepredict1=DecTree.predict(X)

In [42]:
Randforpredict1=Randfor.predict(X)

In [43]:
pd.DataFrame(Randforpredict1).to_csv("D:/analytics/Hackathon/AV_BlackFriday/randfor123.csv") #converting to csv download from home of jupyter notebook then convert the values in csv to exp in csv using exp() the file will ne in local folder